Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
#define PMC_SCDR_PCK_Pos                      _U_(8)                                               /**< (PMC_SCDR Position) Programmable Clock x Output Disable */
#define PMC_SCDR_PCK_Msk                      (_U_(0x3) << PMC_SCDR_PCK_Pos)                       /**< (PMC_SCDR Mask) PCK */
#define PMC_SCDR_PCK(value)                   (PMC_SCDR_PCK_Msk & ((value) << PMC_SCDR_PCK_Pos))   

/* -------- PMC_SCSR : (PMC Offset: 0x08) ( R/ 32) System Clock Status Register -------- */
#define PMC_SCSR_CPU_CLKS_Pos                 _U_(0)                                               /**< (PMC_SCSR) CPU_CLK Status Position */
#define PMC_SCSR_CPU_CLKS_Msk                 (_U_(0x1) << PMC_SCSR_CPU_CLKS_Pos)                  /**< (PMC_SCSR) CPU_CLK Status Mask */
#define PMC_SCSR_CPU_CLKS(value)              (PMC_SCSR_CPU_CLKS_Msk & ((value) << PMC_SCSR_CPU_CLKS_Pos))
#define PMC_SCSR_DDRCK_Pos                    _U_(2)                                               /**< (PMC_SCSR) MPDDRC Clock Status Position */
#define PMC_SCSR_DDRCK_Msk                    (_U_(0x1) << PMC_SCSR_DDRCK_Pos)                     /**< (PMC_SCSR) MPDDRC Clock Status Mask */
#define PMC_SCSR_DDRCK(value)                 (PMC_SCSR_DDRCK_Msk & ((value) << PMC_SCSR_DDRCK_Pos))
#define PMC_SCSR_UHP_Pos                      _U_(6)                                               /**< (PMC_SCSR) USB Host OHCI Clocks Status Position */
#define PMC_SCSR_UHP_Msk                      (_U_(0x1) << PMC_SCSR_UHP_Pos)                       /**< (PMC_SCSR) USB Host OHCI Clocks Status Mask */
#define PMC_SCSR_UHP(value)                   (PMC_SCSR_UHP_Msk & ((value) << PMC_SCSR_UHP_Pos))  
#define PMC_SCSR_PCK0_Pos                     _U_(8)                                               /**< (PMC_SCSR) Programmable Clock 0 Output Status Position */
#define PMC_SCSR_PCK0_Msk                     (_U_(0x1) << PMC_SCSR_PCK0_Pos)                      /**< (PMC_SCSR) Programmable Clock 0 Output Status Mask */
#define PMC_SCSR_PCK0(value)                  (PMC_SCSR_PCK0_Msk & ((value) << PMC_SCSR_PCK0_Pos))
#define PMC_SCSR_PCK1_Pos                     _U_(9)                                               /**< (PMC_SCSR) Programmable Clock 1 Output Status Position */
#define PMC_SCSR_PCK1_Msk                     (_U_(0x1) << PMC_SCSR_PCK1_Pos)                      /**< (PMC_SCSR) Programmable Clock 1 Output Status Mask */
#define PMC_SCSR_PCK1(value)                  (PMC_SCSR_PCK1_Msk & ((value) << PMC_SCSR_PCK1_Pos))
#define PMC_SCSR_QSPICLK_Pos                  _U_(19)                                              /**< (PMC_SCSR) QSPI 2x Clock Status Position */
#define PMC_SCSR_QSPICLK_Msk                  (_U_(0x1) << PMC_SCSR_QSPICLK_Pos)                   /**< (PMC_SCSR) QSPI 2x Clock Status Mask */
#define PMC_SCSR_QSPICLK(value)               (PMC_SCSR_QSPICLK_Msk & ((value) << PMC_SCSR_QSPICLK_Pos))
#define PMC_SCSR_Msk                          _U_(0x00080345)                                      /**< (PMC_SCSR) Register Mask  */

#define PMC_SCSR_PCK_Pos                      _U_(8)                                               /**< (PMC_SCSR Position) Programmable Clock x Output Status */
#define PMC_SCSR_PCK_Msk                      (_U_(0x3) << PMC_SCSR_PCK_Pos)                       /**< (PMC_SCSR Mask) PCK */
#define PMC_SCSR_PCK(value)                   (PMC_SCSR_PCK_Msk & ((value) << PMC_SCSR_PCK_Pos))   

/* -------- PMC_PLL_CTRL0 : (PMC Offset: 0x0C) (R/W 32) PLL Control Register 0 -------- */
#define PMC_PLL_CTRL0_DIVPMC_Pos              _U_(0)                                               /**< (PMC_PLL_CTRL0) Divider for PMC Position */
#define PMC_PLL_CTRL0_DIVPMC_Msk              (_U_(0xFF) << PMC_PLL_CTRL0_DIVPMC_Pos)              /**< (PMC_PLL_CTRL0) Divider for PMC Mask */
#define PMC_PLL_CTRL0_DIVPMC(value)           (PMC_PLL_CTRL0_DIVPMC_Msk & ((value) << PMC_PLL_CTRL0_DIVPMC_Pos))
#define PMC_PLL_CTRL0_ENPLL_Pos               _U_(28)                                              /**< (PMC_PLL_CTRL0) Enable PLL Position */
#define PMC_PLL_CTRL0_ENPLL_Msk               (_U_(0x1) << PMC_PLL_CTRL0_ENPLL_Pos)                /**< (PMC_PLL_CTRL0) Enable PLL Mask */
#define PMC_PLL_CTRL0_ENPLL(value)            (PMC_PLL_CTRL0_ENPLL_Msk & ((value) << PMC_PLL_CTRL0_ENPLL_Pos))
#define PMC_PLL_CTRL0_ENPLLCK_Pos             _U_(29)                                              /**< (PMC_PLL_CTRL0) Enable PLL Clock for PMC Position */
#define PMC_PLL_CTRL0_ENPLLCK_Msk             (_U_(0x1) << PMC_PLL_CTRL0_ENPLLCK_Pos)              /**< (PMC_PLL_CTRL0) Enable PLL Clock for PMC Mask */
#define PMC_PLL_CTRL0_ENPLLCK(value)          (PMC_PLL_CTRL0_ENPLLCK_Msk & ((value) << PMC_PLL_CTRL0_ENPLLCK_Pos))
#define PMC_PLL_CTRL0_ENLOCK_Pos              _U_(31)                                              /**< (PMC_PLL_CTRL0) Enable PLL Lock Position */
#define PMC_PLL_CTRL0_ENLOCK_Msk              (_U_(0x1) << PMC_PLL_CTRL0_ENLOCK_Pos)               /**< (PMC_PLL_CTRL0) Enable PLL Lock Mask */
#define PMC_PLL_CTRL0_ENLOCK(value)           (PMC_PLL_CTRL0_ENLOCK_Msk & ((value) << PMC_PLL_CTRL0_ENLOCK_Pos))
#define PMC_PLL_CTRL0_Msk                     _U_(0xB00000FF)                                      /**< (PMC_PLL_CTRL0) Register Mask  */


/* -------- PMC_PLL_CTRL1 : (PMC Offset: 0x10) (R/W 32) PLL Control Register 1 -------- */
#define PMC_PLL_CTRL1_FRACR_Pos               _U_(0)                                               /**< (PMC_PLL_CTRL1) Fractional Loop Divider Setting Position */
#define PMC_PLL_CTRL1_FRACR_Msk               (_U_(0x3FFFFF) << PMC_PLL_CTRL1_FRACR_Pos)           /**< (PMC_PLL_CTRL1) Fractional Loop Divider Setting Mask */
#define PMC_PLL_CTRL1_FRACR(value)            (PMC_PLL_CTRL1_FRACR_Msk & ((value) << PMC_PLL_CTRL1_FRACR_Pos))
#define PMC_PLL_CTRL1_MUL_Pos                 _U_(24)                                              /**< (PMC_PLL_CTRL1) Multiplier Factor Value Position */
#define PMC_PLL_CTRL1_MUL_Msk                 (_U_(0x7F) << PMC_PLL_CTRL1_MUL_Pos)                 /**< (PMC_PLL_CTRL1) Multiplier Factor Value Mask */
#define PMC_PLL_CTRL1_MUL(value)              (PMC_PLL_CTRL1_MUL_Msk & ((value) << PMC_PLL_CTRL1_MUL_Pos))
#define PMC_PLL_CTRL1_Msk                     _U_(0x7F3FFFFF)                                      /**< (PMC_PLL_CTRL1) Register Mask  */


/* -------- PMC_PLL_SSR : (PMC Offset: 0x14) (R/W 32) PLL Spread Spectrum Register -------- */
#define PMC_PLL_SSR_STEP_Pos                  _U_(0)                                               /**< (PMC_PLL_SSR) Spread Spectrum Step Size Position */
#define PMC_PLL_SSR_STEP_Msk                  (_U_(0xFFFF) << PMC_PLL_SSR_STEP_Pos)                /**< (PMC_PLL_SSR) Spread Spectrum Step Size Mask */
#define PMC_PLL_SSR_STEP(value)               (PMC_PLL_SSR_STEP_Msk & ((value) << PMC_PLL_SSR_STEP_Pos))
#define PMC_PLL_SSR_NSTEP_Pos                 _U_(16)                                              /**< (PMC_PLL_SSR) Spread Spectrum Number of Step Position */
#define PMC_PLL_SSR_NSTEP_Msk                 (_U_(0xFF) << PMC_PLL_SSR_NSTEP_Pos)                 /**< (PMC_PLL_SSR) Spread Spectrum Number of Step Mask */
#define PMC_PLL_SSR_NSTEP(value)              (PMC_PLL_SSR_NSTEP_Msk & ((value) << PMC_PLL_SSR_NSTEP_Pos))
#define PMC_PLL_SSR_ENSPREAD_Pos              _U_(28)                                              /**< (PMC_PLL_SSR) Spread Spectrum Enable Position */
#define PMC_PLL_SSR_ENSPREAD_Msk              (_U_(0x1) << PMC_PLL_SSR_ENSPREAD_Pos)               /**< (PMC_PLL_SSR) Spread Spectrum Enable Mask */
#define PMC_PLL_SSR_ENSPREAD(value)           (PMC_PLL_SSR_ENSPREAD_Msk & ((value) << PMC_PLL_SSR_ENSPREAD_Pos))
#define PMC_PLL_SSR_Msk                       _U_(0x10FFFFFF)                                      /**< (PMC_PLL_SSR) Register Mask  */


