Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
/* -------- PMC_PLL_ACR : (PMC Offset: 0x18) (R/W 32) PLL Analog Control Register -------- */
#define PMC_PLL_ACR_CONTROL_Pos               _U_(0)                                               /**< (PMC_PLL_ACR) PLL CONTROL Value Selection Position */
#define PMC_PLL_ACR_CONTROL_Msk               (_U_(0xFFF) << PMC_PLL_ACR_CONTROL_Pos)              /**< (PMC_PLL_ACR) PLL CONTROL Value Selection Mask */
#define PMC_PLL_ACR_CONTROL(value)            (PMC_PLL_ACR_CONTROL_Msk & ((value) << PMC_PLL_ACR_CONTROL_Pos))
#define PMC_PLL_ACR_UTMIVR_Pos                _U_(12)                                              /**< (PMC_PLL_ACR) UPLL Voltage Regulator Control Position */
#define PMC_PLL_ACR_UTMIVR_Msk                (_U_(0x1) << PMC_PLL_ACR_UTMIVR_Pos)                 /**< (PMC_PLL_ACR) UPLL Voltage Regulator Control Mask */
#define PMC_PLL_ACR_UTMIVR(value)             (PMC_PLL_ACR_UTMIVR_Msk & ((value) << PMC_PLL_ACR_UTMIVR_Pos))
#define PMC_PLL_ACR_UTMIBG_Pos                _U_(13)                                              /**< (PMC_PLL_ACR) UPLL Bandgap Control Position */
#define PMC_PLL_ACR_UTMIBG_Msk                (_U_(0x1) << PMC_PLL_ACR_UTMIBG_Pos)                 /**< (PMC_PLL_ACR) UPLL Bandgap Control Mask */
#define PMC_PLL_ACR_UTMIBG(value)             (PMC_PLL_ACR_UTMIBG_Msk & ((value) << PMC_PLL_ACR_UTMIBG_Pos))
#define PMC_PLL_ACR_LOCK_THR_Pos              _U_(16)                                              /**< (PMC_PLL_ACR) PLL Lock Threshold Value Selection Position */
#define PMC_PLL_ACR_LOCK_THR_Msk              (_U_(0xFF) << PMC_PLL_ACR_LOCK_THR_Pos)              /**< (PMC_PLL_ACR) PLL Lock Threshold Value Selection Mask */
#define PMC_PLL_ACR_LOCK_THR(value)           (PMC_PLL_ACR_LOCK_THR_Msk & ((value) << PMC_PLL_ACR_LOCK_THR_Pos))
#define PMC_PLL_ACR_LOOP_FILTER_Pos           _U_(24)                                              /**< (PMC_PLL_ACR) LOOP Filter Selection Position */
#define PMC_PLL_ACR_LOOP_FILTER_Msk           (_U_(0xFF) << PMC_PLL_ACR_LOOP_FILTER_Pos)           /**< (PMC_PLL_ACR) LOOP Filter Selection Mask */
#define PMC_PLL_ACR_LOOP_FILTER(value)        (PMC_PLL_ACR_LOOP_FILTER_Msk & ((value) << PMC_PLL_ACR_LOOP_FILTER_Pos))
#define PMC_PLL_ACR_Msk                       _U_(0xFFFF3FFF)                                      /**< (PMC_PLL_ACR) Register Mask  */


/* -------- PMC_PLL_UPDT : (PMC Offset: 0x1C) (R/W 32) PLL Update Register -------- */
#define PMC_PLL_UPDT_ID_Pos                   _U_(0)                                               /**< (PMC_PLL_UPDT) PLL ID Position */
#define PMC_PLL_UPDT_ID_Msk                   (_U_(0x1) << PMC_PLL_UPDT_ID_Pos)                    /**< (PMC_PLL_UPDT) PLL ID Mask */
#define PMC_PLL_UPDT_ID(value)                (PMC_PLL_UPDT_ID_Msk & ((value) << PMC_PLL_UPDT_ID_Pos))
#define PMC_PLL_UPDT_UPDATE_Pos               _U_(8)                                               /**< (PMC_PLL_UPDT) PLL Setting Update (write-only) Position */
#define PMC_PLL_UPDT_UPDATE_Msk               (_U_(0x1) << PMC_PLL_UPDT_UPDATE_Pos)                /**< (PMC_PLL_UPDT) PLL Setting Update (write-only) Mask */
#define PMC_PLL_UPDT_UPDATE(value)            (PMC_PLL_UPDT_UPDATE_Msk & ((value) << PMC_PLL_UPDT_UPDATE_Pos))
#define PMC_PLL_UPDT_STUPTIM_Pos              _U_(16)                                              /**< (PMC_PLL_UPDT) Startup Time Position */
#define PMC_PLL_UPDT_STUPTIM_Msk              (_U_(0xFF) << PMC_PLL_UPDT_STUPTIM_Pos)              /**< (PMC_PLL_UPDT) Startup Time Mask */
#define PMC_PLL_UPDT_STUPTIM(value)           (PMC_PLL_UPDT_STUPTIM_Msk & ((value) << PMC_PLL_UPDT_STUPTIM_Pos))
#define PMC_PLL_UPDT_Msk                      _U_(0x00FF0101)                                      /**< (PMC_PLL_UPDT) Register Mask  */


/* -------- CKGR_MOR : (PMC Offset: 0x20) (R/W 32) Main Oscillator Register -------- */
#define CKGR_MOR_MOSCXTEN_Pos                 _U_(0)                                               /**< (CKGR_MOR) Main Crystal Oscillator Enable Position */
#define CKGR_MOR_MOSCXTEN_Msk                 (_U_(0x1) << CKGR_MOR_MOSCXTEN_Pos)                  /**< (CKGR_MOR) Main Crystal Oscillator Enable Mask */
#define CKGR_MOR_MOSCXTEN(value)              (CKGR_MOR_MOSCXTEN_Msk & ((value) << CKGR_MOR_MOSCXTEN_Pos))
#define CKGR_MOR_ULP1_Pos                     _U_(2)                                               /**< (CKGR_MOR) ULP Mode 1 Command (write-only) Position */
#define CKGR_MOR_ULP1_Msk                     (_U_(0x1) << CKGR_MOR_ULP1_Pos)                      /**< (CKGR_MOR) ULP Mode 1 Command (write-only) Mask */
#define CKGR_MOR_ULP1(value)                  (CKGR_MOR_ULP1_Msk & ((value) << CKGR_MOR_ULP1_Pos))
#define CKGR_MOR_MOSCRCEN_Pos                 _U_(3)                                               /**< (CKGR_MOR) Main RC Oscillator Enable Position */
#define CKGR_MOR_MOSCRCEN_Msk                 (_U_(0x1) << CKGR_MOR_MOSCRCEN_Pos)                  /**< (CKGR_MOR) Main RC Oscillator Enable Mask */
#define CKGR_MOR_MOSCRCEN(value)              (CKGR_MOR_MOSCRCEN_Msk & ((value) << CKGR_MOR_MOSCRCEN_Pos))
#define CKGR_MOR_MOSCXTST_Pos                 _U_(8)                                               /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Position */
#define CKGR_MOR_MOSCXTST_Msk                 (_U_(0xFF) << CKGR_MOR_MOSCXTST_Pos)                 /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Mask */
#define CKGR_MOR_MOSCXTST(value)              (CKGR_MOR_MOSCXTST_Msk & ((value) << CKGR_MOR_MOSCXTST_Pos))
#define CKGR_MOR_KEY_Pos                      _U_(16)                                              /**< (CKGR_MOR) Write Access Password Position */
#define CKGR_MOR_KEY_Msk                      (_U_(0xFF) << CKGR_MOR_KEY_Pos)                      /**< (CKGR_MOR) Write Access Password Mask */
#define CKGR_MOR_KEY(value)                   (CKGR_MOR_KEY_Msk & ((value) << CKGR_MOR_KEY_Pos))  
#define   CKGR_MOR_KEY_PASSWD_Val             _U_(0x37)                                            /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define CKGR_MOR_KEY_PASSWD                   (CKGR_MOR_KEY_PASSWD_Val << CKGR_MOR_KEY_Pos)        /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define CKGR_MOR_MOSCSEL_Pos                  _U_(24)                                              /**< (CKGR_MOR) Main Clock Oscillator Selection Position */
#define CKGR_MOR_MOSCSEL_Msk                  (_U_(0x1) << CKGR_MOR_MOSCSEL_Pos)                   /**< (CKGR_MOR) Main Clock Oscillator Selection Mask */
#define CKGR_MOR_MOSCSEL(value)               (CKGR_MOR_MOSCSEL_Msk & ((value) << CKGR_MOR_MOSCSEL_Pos))
#define CKGR_MOR_CFDEN_Pos                    _U_(25)                                              /**< (CKGR_MOR) Clock Failure Detector Enable Position */
#define CKGR_MOR_CFDEN_Msk                    (_U_(0x1) << CKGR_MOR_CFDEN_Pos)                     /**< (CKGR_MOR) Clock Failure Detector Enable Mask */
#define CKGR_MOR_CFDEN(value)                 (CKGR_MOR_CFDEN_Msk & ((value) << CKGR_MOR_CFDEN_Pos))
#define CKGR_MOR_XT32KFME_Pos                 _U_(26)                                              /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Position */
#define CKGR_MOR_XT32KFME_Msk                 (_U_(0x1) << CKGR_MOR_XT32KFME_Pos)                  /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Mask */
#define CKGR_MOR_XT32KFME(value)              (CKGR_MOR_XT32KFME_Msk & ((value) << CKGR_MOR_XT32KFME_Pos))
#define CKGR_MOR_BMCKRST_Pos                  _U_(27)                                              /**< (CKGR_MOR) Bad MCK Clock Reset Enable Position */
#define CKGR_MOR_BMCKRST_Msk                  (_U_(0x1) << CKGR_MOR_BMCKRST_Pos)                   /**< (CKGR_MOR) Bad MCK Clock Reset Enable Mask */
#define CKGR_MOR_BMCKRST(value)               (CKGR_MOR_BMCKRST_Msk & ((value) << CKGR_MOR_BMCKRST_Pos))
#define CKGR_MOR_Msk                          _U_(0x0FFFFF0D)                                      /**< (CKGR_MOR) Register Mask  */

#define CKGR_MOR_ULP_Pos                      _U_(2)                                               /**< (CKGR_MOR Position) ULP Mode x Command (write-only) */
#define CKGR_MOR_ULP_Msk                      (_U_(0x1) << CKGR_MOR_ULP_Pos)                       /**< (CKGR_MOR Mask) ULP */
#define CKGR_MOR_ULP(value)                   (CKGR_MOR_ULP_Msk & ((value) << CKGR_MOR_ULP_Pos))   

/* -------- CKGR_MCFR : (PMC Offset: 0x24) (R/W 32) Main Clock Frequency Register -------- */
#define CKGR_MCFR_MAINF_Pos                   _U_(0)                                               /**< (CKGR_MCFR) Main Clock Frequency Position */
#define CKGR_MCFR_MAINF_Msk                   (_U_(0xFFFF) << CKGR_MCFR_MAINF_Pos)                 /**< (CKGR_MCFR) Main Clock Frequency Mask */
#define CKGR_MCFR_MAINF(value)                (CKGR_MCFR_MAINF_Msk & ((value) << CKGR_MCFR_MAINF_Pos))
#define CKGR_MCFR_MAINFRDY_Pos                _U_(16)                                              /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Position */
#define CKGR_MCFR_MAINFRDY_Msk                (_U_(0x1) << CKGR_MCFR_MAINFRDY_Pos)                 /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Mask */
#define CKGR_MCFR_MAINFRDY(value)             (CKGR_MCFR_MAINFRDY_Msk & ((value) << CKGR_MCFR_MAINFRDY_Pos))
#define CKGR_MCFR_RCMEAS_Pos                  _U_(20)                                              /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Position */
#define CKGR_MCFR_RCMEAS_Msk                  (_U_(0x1) << CKGR_MCFR_RCMEAS_Pos)                   /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Mask */
#define CKGR_MCFR_RCMEAS(value)               (CKGR_MCFR_RCMEAS_Msk & ((value) << CKGR_MCFR_RCMEAS_Pos))
#define CKGR_MCFR_CCSS_Pos                    _U_(24)                                              /**< (CKGR_MCFR) Counter Clock Source Selection Position */
#define CKGR_MCFR_CCSS_Msk                    (_U_(0x1) << CKGR_MCFR_CCSS_Pos)                     /**< (CKGR_MCFR) Counter Clock Source Selection Mask */
#define CKGR_MCFR_CCSS(value)                 (CKGR_MCFR_CCSS_Msk & ((value) << CKGR_MCFR_CCSS_Pos))
#define CKGR_MCFR_Msk                         _U_(0x0111FFFF)                                      /**< (CKGR_MCFR) Register Mask  */


/* -------- PMC_CPU_CKR : (PMC Offset: 0x28) (R/W 32) CPU Clock Register -------- */
#define PMC_CPU_CKR_CSS_Pos                   _U_(0)                                               /**< (PMC_CPU_CKR) MCK Source Selection Position */
#define PMC_CPU_CKR_CSS_Msk                   (_U_(0x3) << PMC_CPU_CKR_CSS_Pos)                    /**< (PMC_CPU_CKR) MCK Source Selection Mask */
#define PMC_CPU_CKR_CSS(value)                (PMC_CPU_CKR_CSS_Msk & ((value) << PMC_CPU_CKR_CSS_Pos))
#define   PMC_CPU_CKR_CSS_SLOW_CLK_Val        _U_(0x0)                                             /**< (PMC_CPU_CKR) MD_SLCK is selected  */
#define   PMC_CPU_CKR_CSS_MAIN_CLK_Val        _U_(0x1)                                             /**< (PMC_CPU_CKR) MAINCK is selected  */
#define   PMC_CPU_CKR_CSS_PLLACK_Val          _U_(0x2)                                             /**< (PMC_CPU_CKR) PLLACK is selected  */
#define   PMC_CPU_CKR_CSS_UPLLCK_Val          _U_(0x3)                                             /**< (PMC_CPU_CKR) UPLL is selected  */
#define PMC_CPU_CKR_CSS_SLOW_CLK              (PMC_CPU_CKR_CSS_SLOW_CLK_Val << PMC_CPU_CKR_CSS_Pos) /**< (PMC_CPU_CKR) MD_SLCK is selected Position  */
#define PMC_CPU_CKR_CSS_MAIN_CLK              (PMC_CPU_CKR_CSS_MAIN_CLK_Val << PMC_CPU_CKR_CSS_Pos) /**< (PMC_CPU_CKR) MAINCK is selected Position  */
#define PMC_CPU_CKR_CSS_PLLACK                (PMC_CPU_CKR_CSS_PLLACK_Val << PMC_CPU_CKR_CSS_Pos)  /**< (PMC_CPU_CKR) PLLACK is selected Position  */
#define PMC_CPU_CKR_CSS_UPLLCK                (PMC_CPU_CKR_CSS_UPLLCK_Val << PMC_CPU_CKR_CSS_Pos)  /**< (PMC_CPU_CKR) UPLL is selected Position  */
#define PMC_CPU_CKR_PRES_Pos                  _U_(4)                                               /**< (PMC_CPU_CKR) Processor Clock Prescaler Position */
#define PMC_CPU_CKR_PRES_Msk                  (_U_(0x7) << PMC_CPU_CKR_PRES_Pos)                   /**< (PMC_CPU_CKR) Processor Clock Prescaler Mask */
#define PMC_CPU_CKR_PRES(value)               (PMC_CPU_CKR_PRES_Msk & ((value) << PMC_CPU_CKR_PRES_Pos))
#define   PMC_CPU_CKR_PRES_CLK_1_Val          _U_(0x0)                                             /**< (PMC_CPU_CKR) Selected clock  */
#define   PMC_CPU_CKR_PRES_CLK_2_Val          _U_(0x1)                                             /**< (PMC_CPU_CKR) Selected clock divided by 2  */
#define   PMC_CPU_CKR_PRES_CLK_4_Val          _U_(0x2)                                             /**< (PMC_CPU_CKR) Selected clock divided by 4  */
#define   PMC_CPU_CKR_PRES_CLK_8_Val          _U_(0x3)                                             /**< (PMC_CPU_CKR) Selected clock divided by 8  */
#define   PMC_CPU_CKR_PRES_CLK_16_Val         _U_(0x4)                                             /**< (PMC_CPU_CKR) Selected clock divided by 16  */
#define   PMC_CPU_CKR_PRES_CLK_32_Val         _U_(0x5)                                             /**< (PMC_CPU_CKR) Selected clock divided by 32  */
#define   PMC_CPU_CKR_PRES_CLK_64_Val         _U_(0x6)                                             /**< (PMC_CPU_CKR) Selected clock divided by 64  */
#define   PMC_CPU_CKR_PRES_CLK_3_Val          _U_(0x7)                                             /**< (PMC_CPU_CKR) Selected clock divided by 3  */
#define PMC_CPU_CKR_PRES_CLK_1                (PMC_CPU_CKR_PRES_CLK_1_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock Position  */
#define PMC_CPU_CKR_PRES_CLK_2                (PMC_CPU_CKR_PRES_CLK_2_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 2 Position  */
#define PMC_CPU_CKR_PRES_CLK_4                (PMC_CPU_CKR_PRES_CLK_4_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 4 Position  */
#define PMC_CPU_CKR_PRES_CLK_8                (PMC_CPU_CKR_PRES_CLK_8_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 8 Position  */
#define PMC_CPU_CKR_PRES_CLK_16               (PMC_CPU_CKR_PRES_CLK_16_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 16 Position  */
#define PMC_CPU_CKR_PRES_CLK_32               (PMC_CPU_CKR_PRES_CLK_32_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 32 Position  */
#define PMC_CPU_CKR_PRES_CLK_64               (PMC_CPU_CKR_PRES_CLK_64_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 64 Position  */
#define PMC_CPU_CKR_PRES_CLK_3                (PMC_CPU_CKR_PRES_CLK_3_Val << PMC_CPU_CKR_PRES_Pos) /**< (PMC_CPU_CKR) Selected clock divided by 3 Position  */
#define PMC_CPU_CKR_MDIV_Pos                  _U_(8)                                               /**< (PMC_CPU_CKR) MCK Division Position */
#define PMC_CPU_CKR_MDIV_Msk                  (_U_(0x3) << PMC_CPU_CKR_MDIV_Pos)                   /**< (PMC_CPU_CKR) MCK Division Mask */
#define PMC_CPU_CKR_MDIV(value)               (PMC_CPU_CKR_MDIV_Msk & ((value) << PMC_CPU_CKR_MDIV_Pos))
#define   PMC_CPU_CKR_MDIV_EQ_PCK_Val         _U_(0x0)                                             /**< (PMC_CPU_CKR) MCK is FCLK divided by 1. MCK_2X is FCLK divided by 1.  */
#define   PMC_CPU_CKR_MDIV_PCK_DIV2_Val       _U_(0x1)                                             /**< (PMC_CPU_CKR) MCK is FCLK divided by 2. MCK_2X is FCLK divided by 1.  */
#define   PMC_CPU_CKR_MDIV_PCK_DIV4_Val       _U_(0x2)                                             /**< (PMC_CPU_CKR) MCK is FCLK divided by 4. MCK_2X is FCLK divided by 2.  */
#define   PMC_CPU_CKR_MDIV_PCK_DIV3_Val       _U_(0x3)                                             /**< (PMC_CPU_CKR) MCK is FCLK divided by 3. MCK_2X is FCLK divided by 1.5.  */
#define PMC_CPU_CKR_MDIV_EQ_PCK               (PMC_CPU_CKR_MDIV_EQ_PCK_Val << PMC_CPU_CKR_MDIV_Pos) /**< (PMC_CPU_CKR) MCK is FCLK divided by 1. MCK_2X is FCLK divided by 1. Position  */
#define PMC_CPU_CKR_MDIV_PCK_DIV2             (PMC_CPU_CKR_MDIV_PCK_DIV2_Val << PMC_CPU_CKR_MDIV_Pos) /**< (PMC_CPU_CKR) MCK is FCLK divided by 2. MCK_2X is FCLK divided by 1. Position  */
#define PMC_CPU_CKR_MDIV_PCK_DIV4             (PMC_CPU_CKR_MDIV_PCK_DIV4_Val << PMC_CPU_CKR_MDIV_Pos) /**< (PMC_CPU_CKR) MCK is FCLK divided by 4. MCK_2X is FCLK divided by 2. Position  */
#define PMC_CPU_CKR_MDIV_PCK_DIV3             (PMC_CPU_CKR_MDIV_PCK_DIV3_Val << PMC_CPU_CKR_MDIV_Pos) /**< (PMC_CPU_CKR) MCK is FCLK divided by 3. MCK_2X is FCLK divided by 1.5. Position  */
#define PMC_CPU_CKR_Msk                       _U_(0x00000373)                                      /**< (PMC_CPU_CKR) Register Mask  */


