Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
/* -------- PMC_PCR : (PMC Offset: 0x88) (R/W 32) Peripheral Control Register -------- */
#define PMC_PCR_PID_Pos                       _U_(0)                                               /**< (PMC_PCR) Peripheral ID Position */
#define PMC_PCR_PID_Msk                       (_U_(0x7F) << PMC_PCR_PID_Pos)                       /**< (PMC_PCR) Peripheral ID Mask */
#define PMC_PCR_PID(value)                    (PMC_PCR_PID_Msk & ((value) << PMC_PCR_PID_Pos))    
#define PMC_PCR_GCLKCSS_Pos                   _U_(8)                                               /**< (PMC_PCR) Generic Clock Source Selection Position */
#define PMC_PCR_GCLKCSS_Msk                   (_U_(0x1F) << PMC_PCR_GCLKCSS_Pos)                   /**< (PMC_PCR) Generic Clock Source Selection Mask */
#define PMC_PCR_GCLKCSS(value)                (PMC_PCR_GCLKCSS_Msk & ((value) << PMC_PCR_GCLKCSS_Pos))
#define   PMC_PCR_GCLKCSS_MD_SLOW_CLK_Val     _U_(0x0)                                             /**< (PMC_PCR) MD_SLCK is selected  */
#define   PMC_PCR_GCLKCSS_TD_SLOW_CLOCK_Val   _U_(0x1)                                             /**< (PMC_PCR) TD_SLCK is selected  */
#define   PMC_PCR_GCLKCSS_MAINCK_Val          _U_(0x2)                                             /**< (PMC_PCR) MAINCK is selected  */
#define   PMC_PCR_GCLKCSS_MCK_Val             _U_(0x3)                                             /**< (PMC_PCR) MCK is selected  */
#define   PMC_PCR_GCLKCSS_PLLA_Val            _U_(0x4)                                             /**< (PMC_PCR) PLLA is selected.  */
#define   PMC_PCR_GCLKCSS_UPLL_Val            _U_(0x5)                                             /**< (PMC_PCR) UPLL is selected.  */
#define PMC_PCR_GCLKCSS_MD_SLOW_CLK           (PMC_PCR_GCLKCSS_MD_SLOW_CLK_Val << PMC_PCR_GCLKCSS_Pos) /**< (PMC_PCR) MD_SLCK is selected Position  */
#define PMC_PCR_GCLKCSS_TD_SLOW_CLOCK         (PMC_PCR_GCLKCSS_TD_SLOW_CLOCK_Val << PMC_PCR_GCLKCSS_Pos) /**< (PMC_PCR) TD_SLCK is selected Position  */
#define PMC_PCR_GCLKCSS_MAINCK                (PMC_PCR_GCLKCSS_MAINCK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) MAINCK is selected Position  */
#define PMC_PCR_GCLKCSS_MCK                   (PMC_PCR_GCLKCSS_MCK_Val << PMC_PCR_GCLKCSS_Pos)     /**< (PMC_PCR) MCK is selected Position  */
#define PMC_PCR_GCLKCSS_PLLA                  (PMC_PCR_GCLKCSS_PLLA_Val << PMC_PCR_GCLKCSS_Pos)    /**< (PMC_PCR) PLLA is selected. Position  */
#define PMC_PCR_GCLKCSS_UPLL                  (PMC_PCR_GCLKCSS_UPLL_Val << PMC_PCR_GCLKCSS_Pos)    /**< (PMC_PCR) UPLL is selected. Position  */
#define PMC_PCR_GCLKDIV_Pos                   _U_(20)                                              /**< (PMC_PCR) Generic Clock Division Ratio Position */
#define PMC_PCR_GCLKDIV_Msk                   (_U_(0xFF) << PMC_PCR_GCLKDIV_Pos)                   /**< (PMC_PCR) Generic Clock Division Ratio Mask */
#define PMC_PCR_GCLKDIV(value)                (PMC_PCR_GCLKDIV_Msk & ((value) << PMC_PCR_GCLKDIV_Pos))
#define PMC_PCR_EN_Pos                        _U_(28)                                              /**< (PMC_PCR) Enable Position */
#define PMC_PCR_EN_Msk                        (_U_(0x1) << PMC_PCR_EN_Pos)                         /**< (PMC_PCR) Enable Mask */
#define PMC_PCR_EN(value)                     (PMC_PCR_EN_Msk & ((value) << PMC_PCR_EN_Pos))      
#define PMC_PCR_GCLKEN_Pos                    _U_(29)                                              /**< (PMC_PCR) Generic Clock Enable Position */
#define PMC_PCR_GCLKEN_Msk                    (_U_(0x1) << PMC_PCR_GCLKEN_Pos)                     /**< (PMC_PCR) Generic Clock Enable Mask */
#define PMC_PCR_GCLKEN(value)                 (PMC_PCR_GCLKEN_Msk & ((value) << PMC_PCR_GCLKEN_Pos))
#define PMC_PCR_CMD_Pos                       _U_(31)                                              /**< (PMC_PCR) Command Position */
#define PMC_PCR_CMD_Msk                       (_U_(0x1) << PMC_PCR_CMD_Pos)                        /**< (PMC_PCR) Command Mask */
#define PMC_PCR_CMD(value)                    (PMC_PCR_CMD_Msk & ((value) << PMC_PCR_CMD_Pos))    
#define PMC_PCR_Msk                           _U_(0xBFF01F7F)                                      /**< (PMC_PCR) Register Mask  */


/* -------- PMC_OCR : (PMC Offset: 0x8C) (R/W 32) Oscillator Calibration Register -------- */
#define PMC_OCR_CAL12_Pos                     _U_(16)                                              /**< (PMC_OCR) Main RC Oscillator Calibration Bits Position */
#define PMC_OCR_CAL12_Msk                     (_U_(0x7F) << PMC_OCR_CAL12_Pos)                     /**< (PMC_OCR) Main RC Oscillator Calibration Bits Mask */
#define PMC_OCR_CAL12(value)                  (PMC_OCR_CAL12_Msk & ((value) << PMC_OCR_CAL12_Pos))
#define PMC_OCR_SEL12_Pos                     _U_(23)                                              /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits Position */
#define PMC_OCR_SEL12_Msk                     (_U_(0x1) << PMC_OCR_SEL12_Pos)                      /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits Mask */
#define PMC_OCR_SEL12(value)                  (PMC_OCR_SEL12_Msk & ((value) << PMC_OCR_SEL12_Pos))
#define PMC_OCR_Msk                           _U_(0x00FF0000)                                      /**< (PMC_OCR) Register Mask  */

#define PMC_OCR_SEL_Pos                       _U_(23)                                              /**< (PMC_OCR Position) Selection of Main RC Oscillator Calibration Bits */
#define PMC_OCR_SEL_Msk                       (_U_(0x1) << PMC_OCR_SEL_Pos)                        /**< (PMC_OCR Mask) SEL */
#define PMC_OCR_SEL(value)                    (PMC_OCR_SEL_Msk & ((value) << PMC_OCR_SEL_Pos))     

/* -------- PMC_ULPST : (PMC Offset: 0x98) (R/W 32) ULP Startup Time Register -------- */
#define PMC_ULPST_ULPST_Pos                   _U_(0)                                               /**< (PMC_ULPST) Ultra Low Power Mode Startup Time Position */
#define PMC_ULPST_ULPST_Msk                   (_U_(0xFF) << PMC_ULPST_ULPST_Pos)                   /**< (PMC_ULPST) Ultra Low Power Mode Startup Time Mask */
#define PMC_ULPST_ULPST(value)                (PMC_ULPST_ULPST_Msk & ((value) << PMC_ULPST_ULPST_Pos))
#define PMC_ULPST_KEY_Pos                     _U_(24)                                              /**< (PMC_ULPST) Write Access Password Position */
#define PMC_ULPST_KEY_Msk                     (_U_(0xFF) << PMC_ULPST_KEY_Pos)                     /**< (PMC_ULPST) Write Access Password Mask */
#define PMC_ULPST_KEY(value)                  (PMC_ULPST_KEY_Msk & ((value) << PMC_ULPST_KEY_Pos))
#define   PMC_ULPST_KEY_PASSWD_Val            _U_(0x5A)                                            /**< (PMC_ULPST) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define PMC_ULPST_KEY_PASSWD                  (PMC_ULPST_KEY_PASSWD_Val << PMC_ULPST_KEY_Pos)      /**< (PMC_ULPST) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define PMC_ULPST_Msk                         _U_(0xFF0000FF)                                      /**< (PMC_ULPST) Register Mask  */


