Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
#define PMC_CSR0_PID_Pos                      _U_(2)                                               /**< (PMC_CSR0 Position) Peripheral Clock 3x Status */
#define PMC_CSR0_PID_Msk                      (_U_(0xFFFFFFF) << PMC_CSR0_PID_Pos)                 /**< (PMC_CSR0 Mask) PID */
#define PMC_CSR0_PID(value)                   (PMC_CSR0_PID_Msk & ((value) << PMC_CSR0_PID_Pos))   

/* -------- PMC_CSR1 : (PMC Offset: 0xA4) ( R/ 32) Peripheral Clock Status Register 1 -------- */
#define PMC_CSR1_PID32_Pos                    _U_(0)                                               /**< (PMC_CSR1) Peripheral Clock 32 Status Position */
#define PMC_CSR1_PID32_Msk                    (_U_(0x1) << PMC_CSR1_PID32_Pos)                     /**< (PMC_CSR1) Peripheral Clock 32 Status Mask */
#define PMC_CSR1_PID32(value)                 (PMC_CSR1_PID32_Msk & ((value) << PMC_CSR1_PID32_Pos))
#define PMC_CSR1_PID33_Pos                    _U_(1)                                               /**< (PMC_CSR1) Peripheral Clock 33 Status Position */
#define PMC_CSR1_PID33_Msk                    (_U_(0x1) << PMC_CSR1_PID33_Pos)                     /**< (PMC_CSR1) Peripheral Clock 33 Status Mask */
#define PMC_CSR1_PID33(value)                 (PMC_CSR1_PID33_Msk & ((value) << PMC_CSR1_PID33_Pos))
#define PMC_CSR1_PID34_Pos                    _U_(2)                                               /**< (PMC_CSR1) Peripheral Clock 34 Status Position */
#define PMC_CSR1_PID34_Msk                    (_U_(0x1) << PMC_CSR1_PID34_Pos)                     /**< (PMC_CSR1) Peripheral Clock 34 Status Mask */
#define PMC_CSR1_PID34(value)                 (PMC_CSR1_PID34_Msk & ((value) << PMC_CSR1_PID34_Pos))
#define PMC_CSR1_PID35_Pos                    _U_(3)                                               /**< (PMC_CSR1) Peripheral Clock 35 Status Position */
#define PMC_CSR1_PID35_Msk                    (_U_(0x1) << PMC_CSR1_PID35_Pos)                     /**< (PMC_CSR1) Peripheral Clock 35 Status Mask */
#define PMC_CSR1_PID35(value)                 (PMC_CSR1_PID35_Msk & ((value) << PMC_CSR1_PID35_Pos))
#define PMC_CSR1_PID36_Pos                    _U_(4)                                               /**< (PMC_CSR1) Peripheral Clock 36 Status Position */
#define PMC_CSR1_PID36_Msk                    (_U_(0x1) << PMC_CSR1_PID36_Pos)                     /**< (PMC_CSR1) Peripheral Clock 36 Status Mask */
#define PMC_CSR1_PID36(value)                 (PMC_CSR1_PID36_Msk & ((value) << PMC_CSR1_PID36_Pos))
#define PMC_CSR1_PID37_Pos                    _U_(5)                                               /**< (PMC_CSR1) Peripheral Clock 37 Status Position */
#define PMC_CSR1_PID37_Msk                    (_U_(0x1) << PMC_CSR1_PID37_Pos)                     /**< (PMC_CSR1) Peripheral Clock 37 Status Mask */
#define PMC_CSR1_PID37(value)                 (PMC_CSR1_PID37_Msk & ((value) << PMC_CSR1_PID37_Pos))
#define PMC_CSR1_PID38_Pos                    _U_(6)                                               /**< (PMC_CSR1) Peripheral Clock 38 Status Position */
#define PMC_CSR1_PID38_Msk                    (_U_(0x1) << PMC_CSR1_PID38_Pos)                     /**< (PMC_CSR1) Peripheral Clock 38 Status Mask */
#define PMC_CSR1_PID38(value)                 (PMC_CSR1_PID38_Msk & ((value) << PMC_CSR1_PID38_Pos))
#define PMC_CSR1_PID39_Pos                    _U_(7)                                               /**< (PMC_CSR1) Peripheral Clock 39 Status Position */
#define PMC_CSR1_PID39_Msk                    (_U_(0x1) << PMC_CSR1_PID39_Pos)                     /**< (PMC_CSR1) Peripheral Clock 39 Status Mask */
#define PMC_CSR1_PID39(value)                 (PMC_CSR1_PID39_Msk & ((value) << PMC_CSR1_PID39_Pos))
#define PMC_CSR1_PID40_Pos                    _U_(8)                                               /**< (PMC_CSR1) Peripheral Clock 40 Status Position */
#define PMC_CSR1_PID40_Msk                    (_U_(0x1) << PMC_CSR1_PID40_Pos)                     /**< (PMC_CSR1) Peripheral Clock 40 Status Mask */
#define PMC_CSR1_PID40(value)                 (PMC_CSR1_PID40_Msk & ((value) << PMC_CSR1_PID40_Pos))
#define PMC_CSR1_PID41_Pos                    _U_(9)                                               /**< (PMC_CSR1) Peripheral Clock 41 Status Position */
#define PMC_CSR1_PID41_Msk                    (_U_(0x1) << PMC_CSR1_PID41_Pos)                     /**< (PMC_CSR1) Peripheral Clock 41 Status Mask */
#define PMC_CSR1_PID41(value)                 (PMC_CSR1_PID41_Msk & ((value) << PMC_CSR1_PID41_Pos))
#define PMC_CSR1_PID42_Pos                    _U_(10)                                              /**< (PMC_CSR1) Peripheral Clock 42 Status Position */
#define PMC_CSR1_PID42_Msk                    (_U_(0x1) << PMC_CSR1_PID42_Pos)                     /**< (PMC_CSR1) Peripheral Clock 42 Status Mask */
#define PMC_CSR1_PID42(value)                 (PMC_CSR1_PID42_Msk & ((value) << PMC_CSR1_PID42_Pos))
#define PMC_CSR1_PID43_Pos                    _U_(11)                                              /**< (PMC_CSR1) Peripheral Clock 43 Status Position */
#define PMC_CSR1_PID43_Msk                    (_U_(0x1) << PMC_CSR1_PID43_Pos)                     /**< (PMC_CSR1) Peripheral Clock 43 Status Mask */
#define PMC_CSR1_PID43(value)                 (PMC_CSR1_PID43_Msk & ((value) << PMC_CSR1_PID43_Pos))
#define PMC_CSR1_PID44_Pos                    _U_(12)                                              /**< (PMC_CSR1) Peripheral Clock 44 Status Position */
#define PMC_CSR1_PID44_Msk                    (_U_(0x1) << PMC_CSR1_PID44_Pos)                     /**< (PMC_CSR1) Peripheral Clock 44 Status Mask */
#define PMC_CSR1_PID44(value)                 (PMC_CSR1_PID44_Msk & ((value) << PMC_CSR1_PID44_Pos))
#define PMC_CSR1_PID45_Pos                    _U_(13)                                              /**< (PMC_CSR1) Peripheral Clock 45 Status Position */
#define PMC_CSR1_PID45_Msk                    (_U_(0x1) << PMC_CSR1_PID45_Pos)                     /**< (PMC_CSR1) Peripheral Clock 45 Status Mask */
#define PMC_CSR1_PID45(value)                 (PMC_CSR1_PID45_Msk & ((value) << PMC_CSR1_PID45_Pos))
#define PMC_CSR1_Msk                          _U_(0x00003FFF)                                      /**< (PMC_CSR1) Register Mask  */

#define PMC_CSR1_PID_Pos                      _U_(0)                                               /**< (PMC_CSR1 Position) Peripheral Clock 45 Status */
#define PMC_CSR1_PID_Msk                      (_U_(0x3FFF) << PMC_CSR1_PID_Pos)                    /**< (PMC_CSR1 Mask) PID */
#define PMC_CSR1_PID(value)                   (PMC_CSR1_PID_Msk & ((value) << PMC_CSR1_PID_Pos))   

/* -------- PMC_CSR2 : (PMC Offset: 0xA8) ( R/ 32) Peripheral Clock Status Register 2 -------- */
#define PMC_CSR2_Msk                          _U_(0x00000000)                                      /**< (PMC_CSR2) Register Mask  */


/* -------- PMC_CSR3 : (PMC Offset: 0xAC) ( R/ 32) Peripheral Clock Status Register 3 -------- */
#define PMC_CSR3_Msk                          _U_(0x00000000)                                      /**< (PMC_CSR3) Register Mask  */


