Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
/* -------- PMC_GCSR0 : (PMC Offset: 0xC0) ( R/ 32) Generic Clock Status Register 0 -------- */
#define PMC_GCSR0_GPID5_Pos                   _U_(5)                                               /**< (PMC_GCSR0) Generic Clock 5 Status Position */
#define PMC_GCSR0_GPID5_Msk                   (_U_(0x1) << PMC_GCSR0_GPID5_Pos)                    /**< (PMC_GCSR0) Generic Clock 5 Status Mask */
#define PMC_GCSR0_GPID5(value)                (PMC_GCSR0_GPID5_Msk & ((value) << PMC_GCSR0_GPID5_Pos))
#define PMC_GCSR0_GPID6_Pos                   _U_(6)                                               /**< (PMC_GCSR0) Generic Clock 6 Status Position */
#define PMC_GCSR0_GPID6_Msk                   (_U_(0x1) << PMC_GCSR0_GPID6_Pos)                    /**< (PMC_GCSR0) Generic Clock 6 Status Mask */
#define PMC_GCSR0_GPID6(value)                (PMC_GCSR0_GPID6_Msk & ((value) << PMC_GCSR0_GPID6_Pos))
#define PMC_GCSR0_GPID7_Pos                   _U_(7)                                               /**< (PMC_GCSR0) Generic Clock 7 Status Position */
#define PMC_GCSR0_GPID7_Msk                   (_U_(0x1) << PMC_GCSR0_GPID7_Pos)                    /**< (PMC_GCSR0) Generic Clock 7 Status Mask */
#define PMC_GCSR0_GPID7(value)                (PMC_GCSR0_GPID7_Msk & ((value) << PMC_GCSR0_GPID7_Pos))
#define PMC_GCSR0_GPID8_Pos                   _U_(8)                                               /**< (PMC_GCSR0) Generic Clock 8 Status Position */
#define PMC_GCSR0_GPID8_Msk                   (_U_(0x1) << PMC_GCSR0_GPID8_Pos)                    /**< (PMC_GCSR0) Generic Clock 8 Status Mask */
#define PMC_GCSR0_GPID8(value)                (PMC_GCSR0_GPID8_Msk & ((value) << PMC_GCSR0_GPID8_Pos))
#define PMC_GCSR0_GPID9_Pos                   _U_(9)                                               /**< (PMC_GCSR0) Generic Clock 9 Status Position */
#define PMC_GCSR0_GPID9_Msk                   (_U_(0x1) << PMC_GCSR0_GPID9_Pos)                    /**< (PMC_GCSR0) Generic Clock 9 Status Mask */
#define PMC_GCSR0_GPID9(value)                (PMC_GCSR0_GPID9_Msk & ((value) << PMC_GCSR0_GPID9_Pos))
#define PMC_GCSR0_GPID10_Pos                  _U_(10)                                              /**< (PMC_GCSR0) Generic Clock 10 Status Position */
#define PMC_GCSR0_GPID10_Msk                  (_U_(0x1) << PMC_GCSR0_GPID10_Pos)                   /**< (PMC_GCSR0) Generic Clock 10 Status Mask */
#define PMC_GCSR0_GPID10(value)               (PMC_GCSR0_GPID10_Msk & ((value) << PMC_GCSR0_GPID10_Pos))
#define PMC_GCSR0_GPID11_Pos                  _U_(11)                                              /**< (PMC_GCSR0) Generic Clock 11 Status Position */
#define PMC_GCSR0_GPID11_Msk                  (_U_(0x1) << PMC_GCSR0_GPID11_Pos)                   /**< (PMC_GCSR0) Generic Clock 11 Status Mask */
#define PMC_GCSR0_GPID11(value)               (PMC_GCSR0_GPID11_Msk & ((value) << PMC_GCSR0_GPID11_Pos))
#define PMC_GCSR0_GPID12_Pos                  _U_(12)                                              /**< (PMC_GCSR0) Generic Clock 12 Status Position */
#define PMC_GCSR0_GPID12_Msk                  (_U_(0x1) << PMC_GCSR0_GPID12_Pos)                   /**< (PMC_GCSR0) Generic Clock 12 Status Mask */
#define PMC_GCSR0_GPID12(value)               (PMC_GCSR0_GPID12_Msk & ((value) << PMC_GCSR0_GPID12_Pos))
#define PMC_GCSR0_GPID13_Pos                  _U_(13)                                              /**< (PMC_GCSR0) Generic Clock 13 Status Position */
#define PMC_GCSR0_GPID13_Msk                  (_U_(0x1) << PMC_GCSR0_GPID13_Pos)                   /**< (PMC_GCSR0) Generic Clock 13 Status Mask */
#define PMC_GCSR0_GPID13(value)               (PMC_GCSR0_GPID13_Msk & ((value) << PMC_GCSR0_GPID13_Pos))
#define PMC_GCSR0_GPID14_Pos                  _U_(14)                                              /**< (PMC_GCSR0) Generic Clock 14 Status Position */
#define PMC_GCSR0_GPID14_Msk                  (_U_(0x1) << PMC_GCSR0_GPID14_Pos)                   /**< (PMC_GCSR0) Generic Clock 14 Status Mask */
#define PMC_GCSR0_GPID14(value)               (PMC_GCSR0_GPID14_Msk & ((value) << PMC_GCSR0_GPID14_Pos))
#define PMC_GCSR0_GPID15_Pos                  _U_(15)                                              /**< (PMC_GCSR0) Generic Clock 15 Status Position */
#define PMC_GCSR0_GPID15_Msk                  (_U_(0x1) << PMC_GCSR0_GPID15_Pos)                   /**< (PMC_GCSR0) Generic Clock 15 Status Mask */
#define PMC_GCSR0_GPID15(value)               (PMC_GCSR0_GPID15_Msk & ((value) << PMC_GCSR0_GPID15_Pos))
#define PMC_GCSR0_GPID16_Pos                  _U_(16)                                              /**< (PMC_GCSR0) Generic Clock 16 Status Position */
#define PMC_GCSR0_GPID16_Msk                  (_U_(0x1) << PMC_GCSR0_GPID16_Pos)                   /**< (PMC_GCSR0) Generic Clock 16 Status Mask */
#define PMC_GCSR0_GPID16(value)               (PMC_GCSR0_GPID16_Msk & ((value) << PMC_GCSR0_GPID16_Pos))
#define PMC_GCSR0_GPID17_Pos                  _U_(17)                                              /**< (PMC_GCSR0) Generic Clock 17 Status Position */
#define PMC_GCSR0_GPID17_Msk                  (_U_(0x1) << PMC_GCSR0_GPID17_Pos)                   /**< (PMC_GCSR0) Generic Clock 17 Status Mask */
#define PMC_GCSR0_GPID17(value)               (PMC_GCSR0_GPID17_Msk & ((value) << PMC_GCSR0_GPID17_Pos))
#define PMC_GCSR0_GPID19_Pos                  _U_(19)                                              /**< (PMC_GCSR0) Generic Clock 19 Status Position */
#define PMC_GCSR0_GPID19_Msk                  (_U_(0x1) << PMC_GCSR0_GPID19_Pos)                   /**< (PMC_GCSR0) Generic Clock 19 Status Mask */
#define PMC_GCSR0_GPID19(value)               (PMC_GCSR0_GPID19_Msk & ((value) << PMC_GCSR0_GPID19_Pos))
#define PMC_GCSR0_GPID25_Pos                  _U_(25)                                              /**< (PMC_GCSR0) Generic Clock 25 Status Position */
#define PMC_GCSR0_GPID25_Msk                  (_U_(0x1) << PMC_GCSR0_GPID25_Pos)                   /**< (PMC_GCSR0) Generic Clock 25 Status Mask */
#define PMC_GCSR0_GPID25(value)               (PMC_GCSR0_GPID25_Msk & ((value) << PMC_GCSR0_GPID25_Pos))
#define PMC_GCSR0_GPID26_Pos                  _U_(26)                                              /**< (PMC_GCSR0) Generic Clock 26 Status Position */
#define PMC_GCSR0_GPID26_Msk                  (_U_(0x1) << PMC_GCSR0_GPID26_Pos)                   /**< (PMC_GCSR0) Generic Clock 26 Status Mask */
#define PMC_GCSR0_GPID26(value)               (PMC_GCSR0_GPID26_Msk & ((value) << PMC_GCSR0_GPID26_Pos))
#define PMC_GCSR0_Msk                         _U_(0x060BFFE0)                                      /**< (PMC_GCSR0) Register Mask  */

#define PMC_GCSR0_GPID_Pos                    _U_(5)                                               /**< (PMC_GCSR0 Position) Generic Clock 26 Status */
#define PMC_GCSR0_GPID_Msk                    (_U_(0xFFFF) << PMC_GCSR0_GPID_Pos)                  /**< (PMC_GCSR0 Mask) GPID */
#define PMC_GCSR0_GPID(value)                 (PMC_GCSR0_GPID_Msk & ((value) << PMC_GCSR0_GPID_Pos)) 

