Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pmc.h
/* -------- PMC_GCSR1 : (PMC Offset: 0xC4) ( R/ 32) Generic Clock Status Register 1 -------- */
#define PMC_GCSR1_GPID32_Pos                  _U_(0)                                               /**< (PMC_GCSR1) Generic Clock 32 Status Position */
#define PMC_GCSR1_GPID32_Msk                  (_U_(0x1) << PMC_GCSR1_GPID32_Pos)                   /**< (PMC_GCSR1) Generic Clock 32 Status Mask */
#define PMC_GCSR1_GPID32(value)               (PMC_GCSR1_GPID32_Msk & ((value) << PMC_GCSR1_GPID32_Pos))
#define PMC_GCSR1_GPID33_Pos                  _U_(1)                                               /**< (PMC_GCSR1) Generic Clock 33 Status Position */
#define PMC_GCSR1_GPID33_Msk                  (_U_(0x1) << PMC_GCSR1_GPID33_Pos)                   /**< (PMC_GCSR1) Generic Clock 33 Status Mask */
#define PMC_GCSR1_GPID33(value)               (PMC_GCSR1_GPID33_Msk & ((value) << PMC_GCSR1_GPID33_Pos))
#define PMC_GCSR1_GPID34_Pos                  _U_(2)                                               /**< (PMC_GCSR1) Generic Clock 34 Status Position */
#define PMC_GCSR1_GPID34_Msk                  (_U_(0x1) << PMC_GCSR1_GPID34_Pos)                   /**< (PMC_GCSR1) Generic Clock 34 Status Mask */
#define PMC_GCSR1_GPID34(value)               (PMC_GCSR1_GPID34_Msk & ((value) << PMC_GCSR1_GPID34_Pos))
#define PMC_GCSR1_GPID37_Pos                  _U_(5)                                               /**< (PMC_GCSR1) Generic Clock 37 Status Position */
#define PMC_GCSR1_GPID37_Msk                  (_U_(0x1) << PMC_GCSR1_GPID37_Pos)                   /**< (PMC_GCSR1) Generic Clock 37 Status Mask */
#define PMC_GCSR1_GPID37(value)               (PMC_GCSR1_GPID37_Msk & ((value) << PMC_GCSR1_GPID37_Pos))
#define PMC_GCSR1_GPID42_Pos                  _U_(10)                                              /**< (PMC_GCSR1) Generic Clock 42 Status Position */
#define PMC_GCSR1_GPID42_Msk                  (_U_(0x1) << PMC_GCSR1_GPID42_Pos)                   /**< (PMC_GCSR1) Generic Clock 42 Status Mask */
#define PMC_GCSR1_GPID42(value)               (PMC_GCSR1_GPID42_Msk & ((value) << PMC_GCSR1_GPID42_Pos))
#define PMC_GCSR1_GPID45_Pos                  _U_(13)                                              /**< (PMC_GCSR1) Generic Clock 45 Status Position */
#define PMC_GCSR1_GPID45_Msk                  (_U_(0x1) << PMC_GCSR1_GPID45_Pos)                   /**< (PMC_GCSR1) Generic Clock 45 Status Mask */
#define PMC_GCSR1_GPID45(value)               (PMC_GCSR1_GPID45_Msk & ((value) << PMC_GCSR1_GPID45_Pos))
#define PMC_GCSR1_GPID47_Pos                  _U_(15)                                              /**< (PMC_GCSR1) Generic Clock 47 Status Position */
#define PMC_GCSR1_GPID47_Msk                  (_U_(0x1) << PMC_GCSR1_GPID47_Pos)                   /**< (PMC_GCSR1) Generic Clock 47 Status Mask */
#define PMC_GCSR1_GPID47(value)               (PMC_GCSR1_GPID47_Msk & ((value) << PMC_GCSR1_GPID47_Pos))
#define PMC_GCSR1_Msk                         _U_(0x0000A427)                                      /**< (PMC_GCSR1) Register Mask  */

#define PMC_GCSR1_GPID_Pos                    _U_(0)                                               /**< (PMC_GCSR1 Position) Generic Clock 47 Status */
#define PMC_GCSR1_GPID_Msk                    (_U_(0x7F) << PMC_GCSR1_GPID_Pos)                    /**< (PMC_GCSR1 Mask) GPID */
#define PMC_GCSR1_GPID(value)                 (PMC_GCSR1_GPID_Msk & ((value) << PMC_GCSR1_GPID_Pos)) 

/* -------- PMC_GCSR2 : (PMC Offset: 0xC8) ( R/ 32) Generic Clock Status Register 2 -------- */
#define PMC_GCSR2_Msk                         _U_(0x00000000)                                      /**< (PMC_GCSR2) Register Mask  */


/* -------- PMC_GCSR3 : (PMC Offset: 0xCC) ( R/ 32) Generic Clock Status Register 3 -------- */
#define PMC_GCSR3_Msk                         _U_(0x00000000)                                      /**< (PMC_GCSR3) Register Mask  */


/* -------- PMC_PLL_IER : (PMC Offset: 0xE0) ( /W 32) PLL Interrupt Enable Register -------- */
#define PMC_PLL_IER_LOCKA_Pos                 _U_(0)                                               /**< (PMC_PLL_IER) PLLA Lock Interrupt Enable Position */
#define PMC_PLL_IER_LOCKA_Msk                 (_U_(0x1) << PMC_PLL_IER_LOCKA_Pos)                  /**< (PMC_PLL_IER) PLLA Lock Interrupt Enable Mask */
#define PMC_PLL_IER_LOCKA(value)              (PMC_PLL_IER_LOCKA_Msk & ((value) << PMC_PLL_IER_LOCKA_Pos))
#define PMC_PLL_IER_LOCKU_Pos                 _U_(1)                                               /**< (PMC_PLL_IER) UPLL Lock Interrupt Enable Position */
#define PMC_PLL_IER_LOCKU_Msk                 (_U_(0x1) << PMC_PLL_IER_LOCKU_Pos)                  /**< (PMC_PLL_IER) UPLL Lock Interrupt Enable Mask */
#define PMC_PLL_IER_LOCKU(value)              (PMC_PLL_IER_LOCKU_Msk & ((value) << PMC_PLL_IER_LOCKU_Pos))
#define PMC_PLL_IER_UNLOCKA_Pos               _U_(16)                                              /**< (PMC_PLL_IER) PLLA Unlock Interrupt Enable Position */
#define PMC_PLL_IER_UNLOCKA_Msk               (_U_(0x1) << PMC_PLL_IER_UNLOCKA_Pos)                /**< (PMC_PLL_IER) PLLA Unlock Interrupt Enable Mask */
#define PMC_PLL_IER_UNLOCKA(value)            (PMC_PLL_IER_UNLOCKA_Msk & ((value) << PMC_PLL_IER_UNLOCKA_Pos))
#define PMC_PLL_IER_UNLOCKU_Pos               _U_(17)                                              /**< (PMC_PLL_IER) UPLL Unlock Interrupt Enable Position */
#define PMC_PLL_IER_UNLOCKU_Msk               (_U_(0x1) << PMC_PLL_IER_UNLOCKU_Pos)                /**< (PMC_PLL_IER) UPLL Unlock Interrupt Enable Mask */
#define PMC_PLL_IER_UNLOCKU(value)            (PMC_PLL_IER_UNLOCKU_Msk & ((value) << PMC_PLL_IER_UNLOCKU_Pos))
#define PMC_PLL_IER_Msk                       _U_(0x00030003)                                      /**< (PMC_PLL_IER) Register Mask  */


/* -------- PMC_PLL_IDR : (PMC Offset: 0xE4) ( /W 32) PLL Interrupt Disable Register -------- */
#define PMC_PLL_IDR_LOCKA_Pos                 _U_(0)                                               /**< (PMC_PLL_IDR) PLLA Lock Interrupt Disable Position */
#define PMC_PLL_IDR_LOCKA_Msk                 (_U_(0x1) << PMC_PLL_IDR_LOCKA_Pos)                  /**< (PMC_PLL_IDR) PLLA Lock Interrupt Disable Mask */
#define PMC_PLL_IDR_LOCKA(value)              (PMC_PLL_IDR_LOCKA_Msk & ((value) << PMC_PLL_IDR_LOCKA_Pos))
#define PMC_PLL_IDR_LOCKU_Pos                 _U_(1)                                               /**< (PMC_PLL_IDR) UPLL Lock Interrupt Disable Position */
#define PMC_PLL_IDR_LOCKU_Msk                 (_U_(0x1) << PMC_PLL_IDR_LOCKU_Pos)                  /**< (PMC_PLL_IDR) UPLL Lock Interrupt Disable Mask */
#define PMC_PLL_IDR_LOCKU(value)              (PMC_PLL_IDR_LOCKU_Msk & ((value) << PMC_PLL_IDR_LOCKU_Pos))
#define PMC_PLL_IDR_UNLOCKA_Pos               _U_(16)                                              /**< (PMC_PLL_IDR) PLLA Unlock Interrupt Disable Position */
#define PMC_PLL_IDR_UNLOCKA_Msk               (_U_(0x1) << PMC_PLL_IDR_UNLOCKA_Pos)                /**< (PMC_PLL_IDR) PLLA Unlock Interrupt Disable Mask */
#define PMC_PLL_IDR_UNLOCKA(value)            (PMC_PLL_IDR_UNLOCKA_Msk & ((value) << PMC_PLL_IDR_UNLOCKA_Pos))
#define PMC_PLL_IDR_UNLOCKU_Pos               _U_(17)                                              /**< (PMC_PLL_IDR) UPLL Unlock Interrupt Disable Position */
#define PMC_PLL_IDR_UNLOCKU_Msk               (_U_(0x1) << PMC_PLL_IDR_UNLOCKU_Pos)                /**< (PMC_PLL_IDR) UPLL Unlock Interrupt Disable Mask */
#define PMC_PLL_IDR_UNLOCKU(value)            (PMC_PLL_IDR_UNLOCKU_Msk & ((value) << PMC_PLL_IDR_UNLOCKU_Pos))
#define PMC_PLL_IDR_Msk                       _U_(0x00030003)                                      /**< (PMC_PLL_IDR) Register Mask  */


/* -------- PMC_PLL_IMR : (PMC Offset: 0xE8) ( R/ 32) PLL Interrupt Mask Register -------- */
#define PMC_PLL_IMR_LOCKA_Pos                 _U_(0)                                               /**< (PMC_PLL_IMR) PLLA Lock Interrupt Mask Position */
#define PMC_PLL_IMR_LOCKA_Msk                 (_U_(0x1) << PMC_PLL_IMR_LOCKA_Pos)                  /**< (PMC_PLL_IMR) PLLA Lock Interrupt Mask Mask */
#define PMC_PLL_IMR_LOCKA(value)              (PMC_PLL_IMR_LOCKA_Msk & ((value) << PMC_PLL_IMR_LOCKA_Pos))
#define PMC_PLL_IMR_LOCKU_Pos                 _U_(1)                                               /**< (PMC_PLL_IMR) UPLL Lock Interrupt Mask Position */
#define PMC_PLL_IMR_LOCKU_Msk                 (_U_(0x1) << PMC_PLL_IMR_LOCKU_Pos)                  /**< (PMC_PLL_IMR) UPLL Lock Interrupt Mask Mask */
#define PMC_PLL_IMR_LOCKU(value)              (PMC_PLL_IMR_LOCKU_Msk & ((value) << PMC_PLL_IMR_LOCKU_Pos))
#define PMC_PLL_IMR_UNLOCKA_Pos               _U_(16)                                              /**< (PMC_PLL_IMR) PLLA Unlock Interrupt Mask Position */
#define PMC_PLL_IMR_UNLOCKA_Msk               (_U_(0x1) << PMC_PLL_IMR_UNLOCKA_Pos)                /**< (PMC_PLL_IMR) PLLA Unlock Interrupt Mask Mask */
#define PMC_PLL_IMR_UNLOCKA(value)            (PMC_PLL_IMR_UNLOCKA_Msk & ((value) << PMC_PLL_IMR_UNLOCKA_Pos))
#define PMC_PLL_IMR_UNLOCKU_Pos               _U_(17)                                              /**< (PMC_PLL_IMR) UPLL Unlock Interrupt Mask Position */
#define PMC_PLL_IMR_UNLOCKU_Msk               (_U_(0x1) << PMC_PLL_IMR_UNLOCKU_Pos)                /**< (PMC_PLL_IMR) UPLL Unlock Interrupt Mask Mask */
#define PMC_PLL_IMR_UNLOCKU(value)            (PMC_PLL_IMR_UNLOCKU_Msk & ((value) << PMC_PLL_IMR_UNLOCKU_Pos))
#define PMC_PLL_IMR_Msk                       _U_(0x00030003)                                      /**< (PMC_PLL_IMR) Register Mask  */


/* -------- PMC_PLL_ISR0 : (PMC Offset: 0xEC) ( R/ 32) PLL Interrupt Status Register 0 -------- */
#define PMC_PLL_ISR0_LOCKA_Pos                _U_(0)                                               /**< (PMC_PLL_ISR0) PLLA Lock Interrupt Status Position */
#define PMC_PLL_ISR0_LOCKA_Msk                (_U_(0x1) << PMC_PLL_ISR0_LOCKA_Pos)                 /**< (PMC_PLL_ISR0) PLLA Lock Interrupt Status Mask */
#define PMC_PLL_ISR0_LOCKA(value)             (PMC_PLL_ISR0_LOCKA_Msk & ((value) << PMC_PLL_ISR0_LOCKA_Pos))
#define PMC_PLL_ISR0_LOCKU_Pos                _U_(1)                                               /**< (PMC_PLL_ISR0) UPLL Lock Interrupt Status Position */
#define PMC_PLL_ISR0_LOCKU_Msk                (_U_(0x1) << PMC_PLL_ISR0_LOCKU_Pos)                 /**< (PMC_PLL_ISR0) UPLL Lock Interrupt Status Mask */
#define PMC_PLL_ISR0_LOCKU(value)             (PMC_PLL_ISR0_LOCKU_Msk & ((value) << PMC_PLL_ISR0_LOCKU_Pos))
#define PMC_PLL_ISR0_UNLOCKA_Pos              _U_(16)                                              /**< (PMC_PLL_ISR0) PLLA Unlock Interrupt Status Position */
#define PMC_PLL_ISR0_UNLOCKA_Msk              (_U_(0x1) << PMC_PLL_ISR0_UNLOCKA_Pos)               /**< (PMC_PLL_ISR0) PLLA Unlock Interrupt Status Mask */
#define PMC_PLL_ISR0_UNLOCKA(value)           (PMC_PLL_ISR0_UNLOCKA_Msk & ((value) << PMC_PLL_ISR0_UNLOCKA_Pos))
#define PMC_PLL_ISR0_UNLOCKU_Pos              _U_(17)                                              /**< (PMC_PLL_ISR0) UPLL Unlock Interrupt Status Position */
#define PMC_PLL_ISR0_UNLOCKU_Msk              (_U_(0x1) << PMC_PLL_ISR0_UNLOCKU_Pos)               /**< (PMC_PLL_ISR0) UPLL Unlock Interrupt Status Mask */
#define PMC_PLL_ISR0_UNLOCKU(value)           (PMC_PLL_ISR0_UNLOCKU_Msk & ((value) << PMC_PLL_ISR0_UNLOCKU_Pos))
#define PMC_PLL_ISR0_Msk                      _U_(0x00030003)                                      /**< (PMC_PLL_ISR0) Register Mask  */


/* -------- PMC_PLL_ISR1 : (PMC Offset: 0xF0) ( R/ 32) PLL Interrupt Status Register 1 -------- */
#define PMC_PLL_ISR1_UDRA_Pos                 _U_(0)                                               /**< (PMC_PLL_ISR1) PLLA Underflow Position */
#define PMC_PLL_ISR1_UDRA_Msk                 (_U_(0x1) << PMC_PLL_ISR1_UDRA_Pos)                  /**< (PMC_PLL_ISR1) PLLA Underflow Mask */
#define PMC_PLL_ISR1_UDRA(value)              (PMC_PLL_ISR1_UDRA_Msk & ((value) << PMC_PLL_ISR1_UDRA_Pos))
#define PMC_PLL_ISR1_UDRU_Pos                 _U_(1)                                               /**< (PMC_PLL_ISR1) UPLL Underflow Position */
#define PMC_PLL_ISR1_UDRU_Msk                 (_U_(0x1) << PMC_PLL_ISR1_UDRU_Pos)                  /**< (PMC_PLL_ISR1) UPLL Underflow Mask */
#define PMC_PLL_ISR1_UDRU(value)              (PMC_PLL_ISR1_UDRU_Msk & ((value) << PMC_PLL_ISR1_UDRU_Pos))
#define PMC_PLL_ISR1_OVRA_Pos                 _U_(16)                                              /**< (PMC_PLL_ISR1) PLLA Overflow Position */
#define PMC_PLL_ISR1_OVRA_Msk                 (_U_(0x1) << PMC_PLL_ISR1_OVRA_Pos)                  /**< (PMC_PLL_ISR1) PLLA Overflow Mask */
#define PMC_PLL_ISR1_OVRA(value)              (PMC_PLL_ISR1_OVRA_Msk & ((value) << PMC_PLL_ISR1_OVRA_Pos))
#define PMC_PLL_ISR1_OVRU_Pos                 _U_(17)                                              /**< (PMC_PLL_ISR1) UPLL Overflow Position */
#define PMC_PLL_ISR1_OVRU_Msk                 (_U_(0x1) << PMC_PLL_ISR1_OVRU_Pos)                  /**< (PMC_PLL_ISR1) UPLL Overflow Mask */
#define PMC_PLL_ISR1_OVRU(value)              (PMC_PLL_ISR1_OVRU_Msk & ((value) << PMC_PLL_ISR1_OVRU_Pos))
#define PMC_PLL_ISR1_Msk                      _U_(0x00030003)                                      /**< (PMC_PLL_ISR1) Register Mask  */


/* -------- PMC_VERSION : (PMC Offset: 0x110) ( R/ 32) Version Register -------- */
#define PMC_VERSION_VERSION_Pos               _U_(0)                                               /**< (PMC_VERSION) Version of the Hardware Module Position */
#define PMC_VERSION_VERSION_Msk               (_U_(0xFFF) << PMC_VERSION_VERSION_Pos)              /**< (PMC_VERSION) Version of the Hardware Module Mask */
#define PMC_VERSION_VERSION(value)            (PMC_VERSION_VERSION_Msk & ((value) << PMC_VERSION_VERSION_Pos))
#define PMC_VERSION_MFN_Pos                   _U_(16)                                              /**< (PMC_VERSION) Metal Fix Number Position */
#define PMC_VERSION_MFN_Msk                   (_U_(0x7) << PMC_VERSION_MFN_Pos)                    /**< (PMC_VERSION) Metal Fix Number Mask */
#define PMC_VERSION_MFN(value)                (PMC_VERSION_MFN_Msk & ((value) << PMC_VERSION_MFN_Pos))
#define PMC_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (PMC_VERSION) Register Mask  */


/** \brief PMC register offsets definitions */
#define PMC_SCER_REG_OFST              (0x00)              /**< (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_REG_OFST              (0x04)              /**< (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_REG_OFST              (0x08)              /**< (PMC_SCSR) System Clock Status Register Offset */
#define PMC_PLL_CTRL0_REG_OFST         (0x0C)              /**< (PMC_PLL_CTRL0) PLL Control Register 0 Offset */
#define PMC_PLL_CTRL1_REG_OFST         (0x10)              /**< (PMC_PLL_CTRL1) PLL Control Register 1 Offset */
#define PMC_PLL_SSR_REG_OFST           (0x14)              /**< (PMC_PLL_SSR) PLL Spread Spectrum Register Offset */
#define PMC_PLL_ACR_REG_OFST           (0x18)              /**< (PMC_PLL_ACR) PLL Analog Control Register Offset */
#define PMC_PLL_UPDT_REG_OFST          (0x1C)              /**< (PMC_PLL_UPDT) PLL Update Register Offset */
#define CKGR_MOR_REG_OFST              (0x20)              /**< (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_REG_OFST             (0x24)              /**< (CKGR_MCFR) Main Clock Frequency Register Offset */
#define PMC_CPU_CKR_REG_OFST           (0x28)              /**< (PMC_CPU_CKR) CPU Clock Register Offset */
#define PMC_USB_REG_OFST               (0x38)              /**< (PMC_USB) USB Clock Register Offset */
#define PMC_PCK_REG_OFST               (0x40)              /**< (PMC_PCK) Programmable Clock Register Offset */
#define PMC_IER_REG_OFST               (0x60)              /**< (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_REG_OFST               (0x64)              /**< (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_REG_OFST                (0x68)              /**< (PMC_SR) Status Register Offset */
#define PMC_IMR_REG_OFST               (0x6C)              /**< (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FSMR_REG_OFST              (0x70)              /**< (PMC_FSMR) Fast Startup Mode Register Offset */
#define PMC_WCR_REG_OFST               (0x74)              /**< (PMC_WCR) Wakeup Control Register Offset */
#define PMC_FOCR_REG_OFST              (0x78)              /**< (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_WPMR_REG_OFST              (0x80)              /**< (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_REG_OFST              (0x84)              /**< (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCR_REG_OFST               (0x88)              /**< (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR_REG_OFST               (0x8C)              /**< (PMC_OCR) Oscillator Calibration Register Offset */
#define PMC_ULPST_REG_OFST             (0x98)              /**< (PMC_ULPST) ULP Startup Time Register Offset */
#define PMC_MCKLIM_REG_OFST            (0x9C)              /**< (PMC_MCKLIM) MCK Monitor Limits Register Offset */
#define PMC_CSR0_REG_OFST              (0xA0)              /**< (PMC_CSR0) Peripheral Clock Status Register 0 Offset */
#define PMC_CSR1_REG_OFST              (0xA4)              /**< (PMC_CSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_CSR2_REG_OFST              (0xA8)              /**< (PMC_CSR2) Peripheral Clock Status Register 2 Offset */
#define PMC_CSR3_REG_OFST              (0xAC)              /**< (PMC_CSR3) Peripheral Clock Status Register 3 Offset */
#define PMC_GCSR0_REG_OFST             (0xC0)              /**< (PMC_GCSR0) Generic Clock Status Register 0 Offset */
#define PMC_GCSR1_REG_OFST             (0xC4)              /**< (PMC_GCSR1) Generic Clock Status Register 1 Offset */
#define PMC_GCSR2_REG_OFST             (0xC8)              /**< (PMC_GCSR2) Generic Clock Status Register 2 Offset */
#define PMC_GCSR3_REG_OFST             (0xCC)              /**< (PMC_GCSR3) Generic Clock Status Register 3 Offset */
#define PMC_PLL_IER_REG_OFST           (0xE0)              /**< (PMC_PLL_IER) PLL Interrupt Enable Register Offset */
#define PMC_PLL_IDR_REG_OFST           (0xE4)              /**< (PMC_PLL_IDR) PLL Interrupt Disable Register Offset */
#define PMC_PLL_IMR_REG_OFST           (0xE8)              /**< (PMC_PLL_IMR) PLL Interrupt Mask Register Offset */
#define PMC_PLL_ISR0_REG_OFST          (0xEC)              /**< (PMC_PLL_ISR0) PLL Interrupt Status Register 0 Offset */
#define PMC_PLL_ISR1_REG_OFST          (0xF0)              /**< (PMC_PLL_ISR1) PLL Interrupt Status Register 1 Offset */
#define PMC_VERSION_REG_OFST           (0x110)             /**< (PMC_VERSION) Version Register Offset */

